src/cf/Catalogs/уатСтатьиРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСтатьиРасходов</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокОтнесенияЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПорядкиОтнесенияРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.уатРегламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособыРаспределенияДоходовРасходовМеждуТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСпособаРаспределенияЗатрат</Name>
					<Comment>Вариант способа распределения между ТС по объему выработки. 0 - общий, 1 - по колоннам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСпособаРаспределенияЗатратМеждуАналитиками</Name>
					<Comment>Вариант способа распределения между аналитиками по объему выработки. 0 - общий, 1 - по колоннам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиРаспределенияМеждуТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьНаРБП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределениеНепрямыхРасходовПоЗаказам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатРаспределениеНепрямыхДоходовРасходовПоЗаказам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКопироватьПлановыеРасходыВФактические</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеРасходовПоСцепкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияВнутриСцепки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособРаспределенияВнутриСцепки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиРаспределенияМеждуЗаказами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВыработкиРаспределенияМеждуТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Колонна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВыработкиРаспределенияМеждуАналитиками</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Колонна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределенияЗатратМеждуАналитиками</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрямыеРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатПорядкиОтнесенияРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатПорядкиОтнесенияРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрямыеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределяемыеРасходы</Name>
					<Comment>Распределяемые (косвенные) расходы</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатСпособыРаспределенияДоходовРасходовМеждуТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСпособыРаспределенияДоходовРасходовМеждуТС</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеРаспределять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поровну</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСтоимостиТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОбъемуВыработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОбъемуВыработкиМЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПрочимСтатьямЗатрат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноДоходам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатСпособыРаспределенияДоходовРасходовМеждуАналитиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСпособыРаспределенияДоходовРасходовМеждуАналитиками</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РаспределятьПоЗаказам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределятьПоВыработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРаспределять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатСтатьиРасходов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ ЭтоГруппа Тогда
		Если ПорядокОтнесенияЗатрат = Перечисления.уатПорядкиОтнесенияРасходов.ПрямыеРасходы Тогда
			НайденнаяСтрока = ПроверяемыеРеквизиты.Найти("СпособРаспределенияЗатрат");
			Если НайденнаяСтрока <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(НайденнаяСтрока);
			КонецЕсли;
		ИначеЕсли СпособРаспределенияЗатрат = Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуТС.ПоОбъемуВыработки
			ИЛИ СпособРаспределенияЗатрат = Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуТС.ПоОбъемуВыработкиМЛ Тогда
			Если ВариантСпособаРаспределенияЗатрат = 0 Тогда
				ПроверяемыеРеквизиты.Добавить("ПараметрВыработкиРаспределенияМеждуТС");
			Иначе
				ПроверяемыеРеквизиты.Добавить("ПараметрыВыработкиРаспределенияМеждуТС.ПараметрВыработки");
			КонецЕсли;
		КонецЕсли;
		
		Если РаспределениеРасходовПоСцепкам Тогда
			ПроверяемыеРеквизиты.Добавить("СпособРаспределенияВнутриСцепки");
		КонецЕсли;
		
		Если РаспределятьНаРБП Тогда
			Если НЕ ЗначениеЗаполнено(СтатьяРасходов) Тогда
				ПроверяемыеРеквизиты.Добавить("СтатьяРасходов");
			ИначеЕсли СтатьяРасходов.РаспределятьНаРБП Тогда
				ТекстНСТР = НСтр("en='As an item of expenses for the distribution of deferred expenses, there should not be an item with the flag ""Distribute to deferred expenses""';ru='В статье расходов для распределения РБП не должен быть установлен флаг ""Распределять на РБП""'");
				уатОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстНСТР,,,"СтатьяРасходов", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыВыработкиРаспределенияМеждуАналитиками.Найти(Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками.РаспределятьПоВыработке,
			"СпособРаспределенияЗатратМеждуАналитиками") <> Неопределено
			ИЛИ ПараметрыВыработкиРаспределенияМеждуАналитиками.Найти(Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками.РаспределятьПоЗаказам,
			"СпособРаспределенияЗатратМеждуАналитиками") <> Неопределено Тогда
			
			ПроверяемыеРеквизиты.Добавить("СпособРаспределениеНепрямыхРасходовПоЗаказам");
		КонецЕсли;
				
		флПараметрВыработкиНеИспользуется = Ложь;
		флСпособРаспределенияНеУказан = Ложь;
		Для Каждого Текстрока Из ПараметрыВыработкиРаспределенияМеждуАналитиками Цикл
			Если НЕ флСпособРаспределенияНеУказан И НЕ ЗначениеЗаполнено(Текстрока.СпособРаспределенияЗатратМеждуАналитиками) Тогда
				флСпособРаспределенияНеУказан = Истина;
			КонецЕсли;
			Если НЕ флПараметрВыработкиНеИспользуется
				И (Текстрока.СпособРаспределенияЗатратМеждуАналитиками = Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками.РаспределятьПоЗаказам
				И НЕ Текстрока.ПараметрВыработки.ДействуетНаТСМЛ)
				ИЛИ (Текстрока.СпособРаспределенияЗатратМеждуАналитиками = Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками.РаспределятьПоВыработке
				И НЕ ЗначениеЗаполнено(Текстрока.ПараметрВыработки)) Тогда
				флПараметрВыработкиНеИспользуется = Истина;
			КонецЕсли;
		КонецЦикла;
		Если флПараметрВыработкиНеИспользуется Тогда
			ТекстСообщения = "Параметр выработки распределения между аналитиками не указан или не используется при расчете услуг в путевых/маршрутных листах";
			уатОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,,,, Отказ);
		КонецЕсли;
		Если флСпособРаспределенияНеУказан Тогда
			ТекстСообщения = "Не указан способ распределения между аналитиками";
			уатОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
